Repository: MityuninDmitry/ShareByte
Catalog: ShareByte/Localizable.xcstrings
Source language: en
Languages: ru

source: - Also there are some buttons for opening app menu.
ru: - Также есть несколько кнопок для открытия меню приложения,

source: - App versions should be equal for connecting between users. It's important. For example: your app version can be v1.0.1, but your friend app version is v1.0.2. Your versions are not equal, so you can't be connected.
ru: - Версия приложения должна быть одинаковой для подключения между пользователями. Это важно. Например: ваша версия приложения v1.0.1, но у вашего друга v1.0.2. Ваши версии не совпадают, так что вы не сможете подключиться.

source: - Change avatar in any time for better visibility in front of another users in session.
ru: - Изменить аватар в любое время для лучшего представления вас перед другими пользователями;

source: - Change name in any time for better visibility in front of another users in session.
ru: - Изменить имя в любое время для лучшего представления вас перед другими пользователями.

source: - Image limits in presentation - you can select different amount of images for presentation. But not more than current app image limit.
ru: - Ограничения на количество изображений в презентации - вы можете выбрать различное количество картинок для презентации, но не более чем текущее ограничение приложения.

source: - Important: ShareByte requires local network setting enabled. You can check it in app settings. Otherwise you can't find users nearby.
ru: - Важно: ShareByte требует включенной настройки использования локальной сети. Вы можете проверить это в настройках приложения. Иначе вы не сможете искать пользователей рядом.

source: - Initially person has no any role.
ru: - Изначально пользователь не имеет роли.

source: - Invite anoter user to presentation. It can be done only by presenter
ru: - Приглашать другого пользователя к презентации. Это может делать только презентер.

source: - Invite another user into session in any time of presentation.
ru: - Приглашать другого пользователя в сессию в любой момент презентации.

source: - Invite another user to session.
ru: - Приглашать другого пользователя в сессию.

source: - Kick user from session by tapping connected user while session.
ru: - Удалять пользователя из сессии путем нажатия на подключенного пользователя.

source: - Limits depend on free or premium app edition. Free and premium edition has different limits. You can see your limits in app settings inside application.
ru: - Ограничения зависят от того, бесплатное или премиум у вас приложение. Бесплатное и премиальное приложения имеют различные ограничения. Вы можете посмотреть их в настройках внутри приложения.

source: - Make any screenshot of presentation. Screenshot will be empty.
ru: - Делать скриншот любой части презентации. Он будет пустым.

source: - Presenter - person who demonstrates images. If you want to be presenter - tap user and wait while he accepts invitation. He can decline it, but you can invite him again.
ru: - Презентер - персона, которая проводит демонстрацию картинок. Если вы желаете быть презентером - нажмите на пользователя и дождитесь, пока он примет приглашение. Он может отклонить его, но вы можете отправить приглашение повторно.

source: - Presenter can's select more images, than app limit. More about limitations see below.
ru: - Презентер не может выбрать больше картинок, чем лимит картинок приложения. Подробнее об ограничениях смотрите ниже.

source: - Share full images of presentation or particular image while presentation.
ru: - Делиться всем списком картинок презентации или отдельными их них.

source: - Simple app which allows users to share images safety in local internet even while internet connection is lost. Your images can't be downloaded until when presenter shares it manually with you.
ru: - Простое приложение, которое позволяет пользователям безопасно делиться картинками в локальной сети даже при отключенном интернете. Ваши картинки не доступны для скачивания другим пользователям до тех пор, пока вы их не отправите вручную.

source: - There are some limitations for best app performance and quality.
ru: - В приложении введены некоторые ограничения для лучшей производительности и качества его работы.

source: - User limits in session - you can invite different amount of users into session as presenter. But not more than current app user limit.
ru: - Лимит пользователей в сессии - вы можете пригласить различное число пользователей в сессию как презентер, но не более чем текущий лимит пользователей приложения.

source: - Viewer - person who watches images of presenter. If you want to be viewer - accept invitation from another user.
ru: - Вьюер - персона, которая смотрит изображения презентера. Если вы хотите быть вьюером, то примите приглашение от другого пользователя.

source: - Viewer can's watch more images, than app limit. More about limitations see below.
ru: - Вьюер не может просматривать больше изображений, чем лимит приложения. Подробнее об ограничениях смотрите ниже.

source: - Watch presentation and like images.
ru: - Смотреть презентацию и ставить лайки изображениям.

source: - When you are presenter. This section allows select images, upload it to users and change demonstrated image. Also this section allows send images to another users.
ru: - Когда вы являетесь презентером. Эта секция позволяет вам выбирать изображения и презентовать их пользователям. Также эта секция позволяет отправлять картинки другим пользователям.

source: - When you are viewer. This section allows watch presenter's images. Also you can tap ❤️ to send like for demonstrated image.
ru: - Когда вы являетесь вьюером. Эта секция позволяет смотреть картинки презентера. Также вы можете нажать на ❤️, чтобы послать лайк изображению.

source: - You can change your user name or avatar.
ru: - Вы можете изменить ваше имя и аватар.

source: - You can disconnect and reconnect your session by tapping button. Your role and presentation will be cleared.
ru: - Вы можете отключиться от сессии и стать доступным для поиска сессий путем нажатия кнопки. Ваша роль и презентация будут очищены.

source: - You can see your role, another users and their roles.
ru: - Вы можете видеть вашу роль, других пользователей и их роли.

source: Add
ru: Добавить

source: All
ru: Все

source: Any user can:
ru: Каждый пользователь может:

source: App Premium limit users in session is exceed.
ru: Достигнут лимит пользователей в сессии для премиум версии приложения.

source: App version: %@
ru: Версия приложения: %@

source: Buy premium version
ru: Приобрести полную версию

source: Change app language
ru: Сменить язык приложения

source: Common things:
ru: Общее:

source: Connected user limit is reached.
ru: Достигнут предел количества подключенных пользователей.

source: Crop image
ru: Обрезка изображения

source: Default
ru: Бесплатное

source: Default app version
ru: Бесплатная версия приложения

source: Disconnect and stop discover
ru: Отключиться и недоступен для поиска

source: Do you want to accept invitation?
ru: Желаете принять приглашение для просмотра презентации?

source: Do you want to invite him to session and share current presentation?
ru: Желаете пригласить пользователя в сессию?

source: Found
ru: Найден

source: Found new user
ru: Найден новый пользователь

# GALLERY %lld / %lld
source: GALLERY %1$lld / %2$lld
ru: ГАЛЕРЕЯ %1$lld / %2$lld

source: Got invitation from
ru: Приглашение от

source: How many images can be uploaded
ru: Сколько изображений можно загружать

source: How many users can be in session
ru: Сколько пользователей может быть в сессии

source: If you want to demonstrate your images, tap users to become presenter.
ru: Если вы желаете начать демонстрацию картинок, нажмите на пользователей, чтобы стать презентером.

source: If you want to view somebody presentation, accept invitation from another user.
ru: Если вы желаете видеть презентацию другого пользователя, то примите от него приглашение.

source: Image
ru: Картинка

source: Image %lld
ru: Картинка %lld

source: Images
ru: Картинки

source: left presentation.
ru: покинул презентацию

source: Limit users in session is exceed. Buy Premium App version.
ru: Исчерпан лимит пользователей. Приобретите премиум версию.

source: Limitations:
ru: Ограничения:

source: Main rules:
ru: Основные правила:

source: Make discoverable
ru: Доступен для поиска

source: Me
ru: Я

source: Me:
ru: Я:

source: Minus
ru: Минус

source: Name
ru: Имя

source: Not defined role
ru: Роль не задана

source: OK
ru: Понятно

source: Premium
ru: Премиум

source: Premium app version
ru: Премиум версия приложения

source: Presentation
ru: Презентация

source: Presentation:
ru: Презентация:

source: Presenter
ru: Презентер

source: Presenter can:
ru: Презентер может:

source: Purchase premium version for
ru: Купить премиум версию за

source: READY
ru: ГОТОВ

source: Restore purchase
ru: Восстановить покупки

source: Sections:
ru: Разделы:

source: Select images for uploading it to users.
ru: Выберите изображения для загрузки пользователям.

source: SETTINGS
ru: НАСТРОЙКИ

source: ShareByte will show nearby users when any of them open application.
ru: ShareByte покажет ближайших пользователей, когда хотя бы один из них откроет приложение.

source: Show instruction
ru: Показать инструкцию

source: SHOW NOTIFICATION
ru: Показать оповещение

source: Show settings
ru: Открыть настройки

source: Start new presentation
ru: Начать новую презентацию

source: Thank you for using ShareByte application. I hope it will be usefull for you and your friends.
ru: Благодарю за использование ShareByte. Я надеюсь оно будет полезно для вас и ваших друзей.

source: UNKNOWN NAME
ru: ИМЯ НЕ ИЗВЕСТНО

source: UNKNOWN ROLE
ru: РОЛЬ НЕ ИЗВЕСТНА

source: Upload images to peers
ru: Отправить картинки пользователям

source: Uploading images to peers
ru: Загрузка картинок пользователям

source: Users
ru: Пользователи

source: Users:
ru: Пользователи:

source: Viewer
ru: Вьюер

source: Viewer can:
ru: Вьюер может:

source: Viewer can't:
ru: Вьюер не может:

source: Waiting for presenter uploads content
ru: Ожидание, пока презентер загрузит контент

source: You can Invite him again when he will be discoverable.
ru: Вы можете пригласить его повторно, когда он будет в зоне доступа.

source: You can invite only %1$lld users in Default app version. Premium app version supports %2$lld users in session.
ru: В бесплатной версии приложения вы можете пригласить только %1$lld пользователей. Премиум версия поддерживает %2$lld пользователей в сессии.

source: You can select only %1$lld images in Default app version. Premium app version supports %2$lld images.
ru: В бесплатной версии приложения вы можете выбрать только %1$lld картинок. Премиум версия поддерживает выбор %2$lld картинок.

source: You can view only first %1$lld images in Default app version. Premium app version supports %2$lld images.
ru: В бесплатной версии приложения вы можете смотреть только %1$lld картинок. Премиум версия поддерживает %2$lld картинок.

source: You can't communicate because of app version difference. User won't be shown in list of users.
ru: Вы не можете взаимодействовать, у вас разные версии. Он не отображается в списке пользователей.
